#include "lab4.h"

int main() {

    cout << endl << "Створені комплексні числа:" << endl;
    cout << " -----------------------------------------------------------" << endl;

    ComplexNumber K1(3, M_PI/4); // модуль 2, аргумент pi/4
    K1.print(1);
    ComplexNumber K2(4); // модуль 4, аргумент 0
    K2.print(2);
    ComplexNumber K3; // модуль 0, аргумент 0
    K3.print(3);

    cout << endl << "Після інкрементування:" << endl << endl;
    cout << " -----------------------------------------------------------" << endl;

    ++K1; // інкрементування дійсної частини К1
    K1.print(1);

    K2++; // інкрементування уявної частини К2
    K2.print(2);
    
    cout << endl << endl << "К3 після збереження в нього суми К1 + К2:" << endl;
    cout << " -----------------------------------------------------------" << endl;

    K3 = K1 + K2; //збереження в К3 суми змінених чисел К1 і К2
    K3.print(3);

    return 0;
}